Indicates if download the full data of the document, which will take longer than subsequent downloads.
  Namespace:   Autodesk.Revit.DB.Events
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public bool FullDownload { get; }
  Visual Basic
Public ReadOnly Property FullDownload As Boolean
	Get
  Visual C++
public:
property bool FullDownload {
	bool get ();
}
 See Also
  CreateRelatedFileProgressChangedEventArgs Class
  Autodesk.Revit.DB.Events Namespace